xml/Enums/ИИА_ТипДиалога.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Enum>
		<Properties>
			<Name>ИИА_ТипДиалога</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Агент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Запрос1С</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РаспознаваниеДокументов</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

xml/Enums/ИИА_АвторСообщения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ИИА_АвторСообщения</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Пользователь</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИИ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Система</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

xml/Enums/ИИА_ТипСообщения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ИИА_ТипСообщения</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Текст</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Запрос</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Код</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ошибка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

xml/Catalogs/ИИА_Диалоги.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ИИА_Диалоги</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипДиалога</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИИА_ТипДиалога</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Активный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Лог</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеЗначения</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОркестраторВключен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Сообщения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Время</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Автор</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ИИА_АвторСообщения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипСообщения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ИИА_ТипСообщения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Текст</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстКода</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Статус</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>UsageTokens</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусDSL</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ИИА_СтатусDSL</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ИзмененныеОбъекты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СсылкаНаОбъект</Name>
							<Type>
								<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>План</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Задача</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Выполнена</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Результат</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

xml/CommonModules/ИИА_Оркестратор/Ext/Module.bsl
// Запускает серверный оркестратор (фоновый цикл)
//
// Параметры:
//  СсылкаДиалога - СправочникСсылка.ИИА_Диалоги - ссылка на диалог
//
Процедура Запустить(СсылкаДиалога) Экспорт
	
	Если НЕ ЗначениеЗаполнено(СсылкаДиалога) Тогда
		Возврат;
	КонецЕсли;
	
	Диалог = СсылкаДиалога.ПолучитьОбъект();
	Если Диалог.ОркестраторВключен Тогда
		Возврат;
	КонецЕсли;
	
	Диалог.ОркестраторВключен = Истина;
	Диалог.Записать();
	
	ИмяЗадания = "ИИ_Оркестратор_" + Строка(СсылкаДиалога.УникальныйИдентификатор());
	Параметры = Новый Массив;
	Параметры.Добавить(СсылкаДиалога);
	
	// Получаем начальное количество токенов перед запуском
	НачальныеТокены = ИИА_Сервер.ПолучитьОбщееКоличествоТокенов(СсылкаДиалога);
	Параметры.Добавить(НачальныеТокены);
	
	ИИА_Сервер.ДобавитьЗаписьВЛогДиалога(СсылкаДиалога, "[Оркестратор] Запуск серверного движка...");
	
	ФоновыеЗадания.Выполнить("ИИА_Оркестратор.ВыполнитьЦикл", Параметры, , ИмяЗадания);
	
КонецПроцедуры

// Добавляет сообщение пользователя и запускает оркестратор
//
// Параметры:
//  СсылкаДиалога - СправочникСсылка.ИИА_Диалоги - ссылка на диалог
//  Текст - Строка - текст сообщения
//  ТипДиалога - ПеречислениеСсылка.ИИА_ТипДиалога - тип диалога
//
Процедура ОтправитьИЗапустить(СсылкаДиалога, Текст, ТипДиалога) Экспорт
	
	ИИА_Сервер.ДобавитьЗаписьВЛогДиалога(СсылкаДиалога, "[Пользователь] " + Текст);
	
	// 1. Добавляем сообщение пользователя через серверный модуль
	ИИА_Сервер.ОтправитьСообщениеСервера(СсылкаДиалога, ТипДиалога, Текст);
	
	// 2. Запускаем оркестратор
	Запустить(СсылкаДиалога);
	
КонецПроцедуры

// Останавливает серверный оркестратор (мягкая остановка)
//
// Параметры:
//  СсылкаДиалога - СправочникСсылка.ИИА_Диалоги - ссылка на диалог
//
Процедура Остановить(СсылкаДиалога) Экспорт
	
	Если НЕ ЗначениеЗаполнено(СсылкаДиалога) Тогда
		Возврат;
	КонецЕсли;
	
	Диалог = СсылкаДиалога.ПолучитьОбъект();
	Если НЕ Диалог.ОркестраторВключен Тогда
		Возврат;
	КонецЕсли;
	
	Диалог.ОркестраторВключен = Ложь;
	Диалог.Записать();
	
	ИИА_Сервер.ДобавитьЗаписьВЛогДиалога(СсылкаДиалога, "[Оркестратор] Остановка пользователем.");
	
	ОтправитьУведомление(СсылкаДиалога, "ОстановленПользователем");
	
КонецПроцедуры

// Основной цикл серверного оркестратора
//
// Параметры:
//  СсылкаДиалога - СправочникСсылка.ИИА_Диалоги - ссылка на диалог
//  НачальныеТокены - Число - количество токенов на момент старта
//
Процедура ВыполнитьЦикл(СсылкаДиалога, НачальныеТокены = 0) Экспорт
	
	Если НЕ ЗначениеЗаполнено(СсылкаДиалога) Тогда
		Возврат;
	КонецЕсли;
	
	ДиалогОбъект = СсылкаДиалога.ПолучитьОбъект();
	Настройки = ИИА_Сервер.ПолучитьНастройкиПользователя(ДиалогОбъект.Пользователь);
	ЛимитНаЗапуск = Настройки.ЛимитТокеновНаЗапуск;
	
	// Очищаем файл лога отладки при каждом запуске (Запустить / Отправить из формы агента)
	ИИА_Сервер.ОчиститьФайлЛогаОтладки(СсылкаДиалога);
	
	СчетчикИтераций = 0;
	МаксимумИтераций = 50; // защита от бесконечного цикла
	
	Пока Истина Цикл
		
		Попытка
			
			Диалог = СсылкаДиалога.ПолучитьОбъект();
			Если НЕ Диалог.ОркестраторВключен Тогда
				Прервать;
			КонецЕсли;
			
			// Проверка лимита токенов на запуск
			Если ЛимитНаЗапуск > 0 Тогда
				ТекущиеТокены = ИИА_Сервер.ПолучитьОбщееКоличествоТокенов(СсылкаДиалога);
				ПотраченоВЭтомЗапуске = ТекущиеТокены - НачальныеТокены;
				
				Если ПотраченоВЭтомЗапуске >= ЛимитНаЗапуск Тогда
					Диалог.ОркестраторВключен = Ложь;
					Диалог.Записать();
					
					ИИА_Сервер.ДобавитьЗаписьВЛогДиалога(СсылкаДиалога, "[Система] Остановка: превышен лимит токенов на запуск (" + Строка(ЛимитНаЗапуск) + ")");
					ОбновитьСтатусПоследнегоСообщения(СсылкаДиалога, "Остановлено: превышен лимит токенов на запуск (" + Строка(ЛимитНаЗапуск) + ")");
					ОтправитьУведомление(СсылкаДиалога, "ПревышенЛимитТокенов");
					Прервать;
				КонецЕсли;
			КонецЕсли;
			
			// 1. Планирование, если плана нет
			ПланДанные = ПолучитьПланДиалога(СсылкаДиалога);
			Если ПланДанные.Количество() = 0 Тогда
				Если НЕ ИнициализироватьПлан(СсылкаДиалога) Тогда
					Диалог = СсылкаДиалога.ПолучитьОбъект();
					Диалог.ОркестраторВключен = Ложь;
					Диалог.Записать();
					ОбновитьСтатусПоследнегоСообщения(СсылкаДиалога, "Остановлено: ошибка планирования");
					ОтправитьУведомление(СсылкаДиалога, "ОшибкаПлана");
					Прервать;
				КонецЕсли;
				
				Продолжить;
			КонецЕсли;
			
			// 2. Завершение, если план выполнен
			Если ПланЗавершен(СсылкаДиалога) Тогда
				ВыполнитьФинальнуюПроверкуИSummary(СсылкаДиалога);
				Диалог = СсылкаДиалога.ПолучитьОбъект();
				Диалог.ОркестраторВключен = Ложь;
				Диалог.Записать();
				Прервать;
			КонецЕсли;
			
			// 2.5. Защита от бесконечного цикла
			СчетчикИтераций = СчетчикИтераций + 1;
			Если СчетчикИтераций >= МаксимумИтераций Тогда
				ИИА_Сервер.ДобавитьЗаписьВЛогДиалога(СсылкаДиалога, "[Система] Остановка: достигнут лимит итераций (" + Строка(МаксимумИтераций) + "). Пропускаем невыполненные шаги.");
				ПропуститьНевыполненныеШагиПлана(СсылкаДиалога);
				ВыполнитьФинальнуюПроверкуИSummary(СсылкаДиалога);
				Диалог = СсылкаДиалога.ПолучитьОбъект();
				Диалог.ОркестраторВключен = Ложь;
				Диалог.Записать();
				Прервать;
			КонецЕсли;
			
			// 2.6. Пропуск шагов, которые повторно падают (SelectObject без GUI и т.п.)
			ПропуститьПроблемныеШагиПлана(СсылкаДиалога);
			Если ПланЗавершен(СсылкаДиалога) Тогда
				Продолжить;
			КонецЕсли;
			
			// 3. Генерация следующего шага
			СгенерироватьПродолжениеВыполнения(СсылкаДиалога);
			
		Исключение
			// Логируем ошибку и останавливаем оркестратор
			ТекстОшибки = ОписаниеОшибки();
			ИИА_Сервер.ДобавитьЗаписьВЛогДиалога(СсылкаДиалога, "[Оркестратор] КРИТИЧЕСКАЯ ОШИБКА: " + ТекстОшибки);
			
			Диалог = СсылкаДиалога.ПолучитьОбъект();
			Диалог.ОркестраторВключен = Ложь;
			Диалог.Записать();
			
			ОбновитьСтатусПоследнегоСообщения(СсылкаДиалога, "Остановлено: внутренняя ошибка");
			ОтправитьУведомление(СсылкаДиалога, "ОшибкаОркестратора");
			Прервать;
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

#Область ПланированиеИУправление

Функция ОпределитьRAGДляПлана(ТекстЗадачи, ТипДиалога) Экспорт
	
	Результат = Новый Структура("ИспользоватьRAG,Причина", Ложь, "");
	
	Если ТипДиалога = Перечисления.ИИА_ТипДиалога.Запрос1С Тогда
		Результат.ИспользоватьRAG = Истина;
		Результат.Причина = "Тип диалога Запрос1С";
		Возврат Результат;
	КонецЕсли;
	
	Если ПустаяСтрока(ТекстЗадачи) Тогда
		Результат.Причина = "Пустой текст задачи";
		Возврат Результат;
	КонецЕсли;
	
	ТекстВРег = ВРег(ТекстЗадачи);
	
	Ключевые = Новый Массив;
	Ключевые.Добавить("ДОКУМЕНТ");
	Ключевые.Добавить("СПРАВОЧНИК");
	Ключевые.Добавить("РЕГИСТР");
	Ключевые.Добавить("ПЕРЕЧИСЛЕНИ");
	Ключевые.Добавить("НАКЛАДН");
	Ключевые.Добавить("РЕАЛИЗАЦ");
	Ключевые.Добавить("ОТГРУЗК");
	Ключевые.Добавить("ПОСТУПЛЕН");
	Ключевые.Добавить("ПЕРЕМЕЩЕН");
	Ключевые.Добавить("СЧЕТ");
	Ключевые.Добавить("АКТ");
	Ключевые.Добавить("ПЛАТЕЖ");
	Ключевые.Добавить("КАСС");
	Ключевые.Добавить("СКЛАД");
	Ключевые.Добавить("ТОВАР");
	Ключевые.Добавить("УСЛУГ");
	
	Для Каждого Ключ Из Ключевые Цикл
		Если СтрНайти(ТекстВРег, Ключ) > 0 Тогда
			Результат.ИспользоватьRAG = Истина;
			Результат.Причина = "Найдены ключевые слова метаданных";
			Возврат Результат;
		КонецЕсли;
	КонецЦикла;
	
	Результат.Причина = "Ключевые слова метаданных не найдены";
	Возврат Результат;
	
КонецФункции

Функция ЭтоЗапросПодсчета(ТекстЗадачи) Экспорт
	
	Если ПустаяСтрока(ТекстЗадачи) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ТекстВРег = ВРег(ТекстЗадачи);
	Если СтрНайти(ТекстВРег, "СКОЛЬКО") > 0 Тогда
		Возврат Истина;
	КонецЕсли;
	Если СтрНайти(ТекстВРег, "КОЛИЧЕСТВ") > 0 Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

Функция КлючДействияИзDSL(DSL_JSON)
	
	Если ПустаяСтрока(DSL_JSON) Тогда
		Возврат "";
	КонецЕсли;
	
	Попытка
		ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку(DSL_JSON);
		Сценарий = ПрочитатьJSON(ЧтениеJSON);
		ЧтениеJSON.Закрыть();
		
		Шаг = Неопределено;
		Если ТипЗнч(Сценарий) = Тип("Структура") Тогда
			Если Сценарий.Свойство("steps") И ТипЗнч(Сценарий.steps) = Тип("Массив") И Сценарий.steps.Количество() > 0 Тогда
				Шаг = Сценарий.steps[0];
			ИначеЕсли Сценарий.Свойство("action") Тогда
				Шаг = Сценарий;
			КонецЕсли;
		КонецЕсли;
		
		Если Шаг = Неопределено Или НЕ Шаг.Свойство("action") Тогда
			Возврат "";
		КонецЕсли;
		
		Ключ = ВРег(Строка(Шаг.action));
		Если Шаг.Свойство("object_type") И Шаг.Свойство("object_name") Тогда
			Ключ = Ключ + ":" + Строка(Шаг.object_type) + "." + Строка(Шаг.object_name);
		ИначеЕсли Шаг.Свойство("query") Тогда
			Ключ = Ключ + ":" + Лев(ВРег(Строка(Шаг.query)), 80);
		КонецЕсли;
		
		Возврат Ключ;
	Исключение
	КонецПопытки;
	
	Возврат "";
	
КонецФункции

Функция ЭтоПовторДействия(СсылкаДиалога, DSL_JSON, Порог = 2) Экспорт
	
	КлючНового = КлючДействияИзDSL(DSL_JSON);
	Если ПустаяСтрока(КлючНового) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Диалог = СсылкаДиалога.ПолучитьОбъект();
	КоличествоСообщений = Диалог.Сообщения.Количество();
	Если КоличествоСообщений = 0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Счетчик = 0;
	Индекс = КоличествоСообщений - 1;
	Пока Индекс >= 0 Цикл
		СтрокаСообщения = Диалог.Сообщения[Индекс];
		Если СтрокаСообщения.Автор <> Перечисления.ИИА_АвторСообщения.ИИ Тогда
			Индекс = Индекс - 1;
			Продолжить;
		КонецЕсли;
		Если ПустаяСтрока(СтрокаСообщения.ТекстКода) Тогда
			Индекс = Индекс - 1;
			Продолжить;
		КонецЕсли;
		
		КлючПрошлого = КлючДействияИзDSL(СтрокаСообщения.ТекстКода);
		Если ПустаяСтрока(КлючПрошлого) Тогда
			Индекс = Индекс - 1;
			Продолжить;
		КонецЕсли;
		
		Если КлючПрошлого = КлючНового Тогда
			Счетчик = Счетчик + 1;
			Если Счетчик >= Порог Тогда
				Возврат Истина;
			КонецЕсли;
		ИначеЕсли Счетчик > 0 Тогда
			Прервать;
		КонецЕсли;
		
		Индекс = Индекс - 1;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

Функция ИнициализироватьПлан(СсылкаДиалога) Экспорт
	
	// Получаем исходную задачу
	РезультатЗадачи = ИИА_Сервер.ПолучитьПервоеСообщениеПользователя(СсылкаДиалога);
	Если НЕ РезультатЗадачи.Найдено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ТекстЗадачи = РезультатЗадачи.Текст;
	
	// Формируем промпт для создания плана
	ПромптПлана = ИИА_Промты.ПолучитьПромптСозданияПлана(ТекстЗадачи, СсылкаДиалога);
	Если ЭтоЗапросПодсчета(ТекстЗадачи) Тогда
		ПромптПлана = ПромптПлана + Символы.ПС +
		"Дополнительно: если задача содержит 'сколько/количество', план должен включать RunQuery с КОЛИЧЕСТВО(...) и ShowInfo.";
	КонецЕсли;
	
	// Вызываем ИИ (через системное сообщение)
	ПараметрыRAG = ОпределитьRAGДляПлана(ТекстЗадачи, СсылкаДиалога.ТипДиалога);
	ИИА_Сервер.ДобавитьЗаписьВЛогДиалога(СсылкаДиалога, "[RAG_DECISION] План: " + ?(ПараметрыRAG.ИспользоватьRAG, "включен", "выключен") + ". " + ПараметрыRAG.Причина);
	ОтветИИ = ИИА_Сервер.ВызватьИИССистемнымСообщением(СсылкаДиалога, "Чат", ПромптПлана, ИИА_Промты.ПолучитьТекстПромптаПланировщика(), "plan_json_array", , ПараметрыRAG.ИспользоватьRAG);
	
	Если ПустаяСтрока(ОтветИИ.Текст) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	// Парсим JSON массив строк
	Попытка
		ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку(ОтветИИ.Текст);
		МассивПланов = ПрочитатьJSON(ЧтениеJSON);
		ЧтениеJSON.Закрыть();
		
		Если ТипЗнч(МассивПланов) <> Тип("Массив") Тогда
			Возврат Ложь;
		КонецЕсли;
		
		// Сохраняем план в диалог
		Диалог = СсылкаДиалога.ПолучитьОбъект();
		Диалог.План.Очистить();
		
		Для Каждого Пункт Из МассивПланов Цикл
			НоваяСтрока = Диалог.План.Добавить();
			НоваяСтрока.Задача = Пункт;
			НоваяСтрока.Выполнена = Ложь;
		КонецЦикла;
		
		Диалог.Записать();
		
		// Отправляем уведомление клиенту о завершении планирования
		ДанныеУведомления = Новый Структура;
		ДанныеУведомления.Вставить("Диалог", СсылкаДиалога);
		ДанныеУведомления.Вставить("ТипСобытия", "ПланИнициализирован");
		УведомленияКлиента.ОтправитьУведомление("СообщениеПереписки", ДанныеУведомления);
		
		Возврат Истина;
		
	Исключение
		Возврат Ложь;
	КонецПопытки;
	
КонецФункции

Функция ПолучитьПланДиалога(СсылкаДиалога) Экспорт
	
	Результат = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	План.Задача КАК Задача,
	|	План.Выполнена КАК Выполнена,
	|	План.Результат КАК Результат
	|ИЗ
	|	Справочник.ИИА_Диалоги.План КАК План
	|ГДЕ
	|	План.Ссылка = &Ссылка
	|УПОРЯДОЧИТЬ ПО
	|	План.НомерСтроки";
	
	Запрос.УстановитьПараметр("Ссылка", СсылкаДиалога);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Результат.Добавить(Новый Структура("Задача, Выполнена, Результат", Выборка.Задача, Выборка.Выполнена, Выборка.Результат));
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ОбновитьПланПоРезультатам(СсылкаДиалога) Экспорт
	
	Диалог = СсылкаДиалога.ПолучитьОбъект();
	Если Диалог.План.Количество() = 0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	// Преобразуем текущий план в JSON
	МассивПлана = Новый Массив;
	Для Каждого СтрокаПлана Из Диалог.План Цикл
		СтруктураПункта = Новый Структура("Задача, Выполнена, Результат", СтрокаПлана.Задача, СтрокаПлана.Выполнена, СтрокаПлана.Результат);
		МассивПлана.Добавить(СтруктураПункта);
	КонецЦикла;
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, МассивПлана);
	ПланJSON = ЗаписьJSON.Закрыть();
	
	ТекстРезультатов = СобратьФактыПоследнихДействий(СсылкаДиалога);
	ПромптОбновления = ИИА_Промты.ПолучитьПромптОбновленияПлана(ПланJSON, ТекстРезультатов);
	
	// Вызываем ИИ
	ОтветИИ = ИИА_Сервер.ВызватьИИССистемнымСообщением(СсылкаДиалога, "Чат", ПромптОбновления, "", "plan_json_array", , Ложь);
	
	// Парсим ответ ИИ
	Попытка
		ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку(ОтветИИ.Текст);
		ОбновленныйПлан = ПрочитатьJSON(ЧтениеJSON);
		ЧтениеJSON.Закрыть();
		
		Если ТипЗнч(ОбновленныйПлан) <> Тип("Массив") Тогда
			Возврат Ложь;
		КонецЕсли;
		
		// Обновляем ТЧ План в диалоге
		Диалог = СсылкаДиалога.ПолучитьОбъект();
		
		Для Каждого ПунктОбновления Из ОбновленныйПлан Цикл
			Для Каждого СтрокаПлана Из Диалог.План Цикл
				Если СтрокаПлана.Задача = ПунктОбновления.Задача Тогда
					СтрокаПлана.Выполнена = ПунктОбновления.Выполнена;
					СтрокаПлана.Результат = ПунктОбновления.Результат;
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
		
		Диалог.Записать();
		
		// Отправляем уведомление об обновлении плана
		ДанныеУведомления = Новый Структура;
		ДанныеУведомления.Вставить("Диалог", СсылкаДиалога);
		ДанныеУведомления.Вставить("ТипСобытия", "ПланОбновлен");
		УведомленияКлиента.ОтправитьУведомление("СообщениеПереписки", ДанныеУведомления);
		
		Возврат Истина;
		
	Исключение
		Возврат Ложь;
	КонецПопытки;
	
КонецФункции

Функция ПолучитьСледующийПунктПлана(СсылкаДиалога) Экспорт
	
	Диалог = СсылкаДиалога.ПолучитьОбъект();
	
	Для Каждого СтрокаПлана Из Диалог.План Цикл
		Если НЕ СтрокаПлана.Выполнена Тогда
			Возврат СтрокаПлана.Задача;
		КонецЕсли;
	КонецЦикла;
	
	Возврат "";
	
КонецФункции

Функция ПланЗавершен(СсылкаДиалога) Экспорт
	
	Диалог = СсылкаДиалога.ПолучитьОбъект();
	
	Если Диалог.План.Количество() = 0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Для Каждого СтрокаПлана Из Диалог.План Цикл
		Если НЕ СтрокаПлана.Выполнена Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

// Помечает все невыполненные шаги плана как выполненные с результатом "Пропущено (лимит итераций)"
Процедура ПропуститьНевыполненныеШагиПлана(СсылкаДиалога) Экспорт
	
	Диалог = СсылкаДиалога.ПолучитьОбъект();
	
	Для Каждого СтрокаПлана Из Диалог.План Цикл
		Если НЕ СтрокаПлана.Выполнена Тогда
			СтрокаПлана.Выполнена = Истина;
			СтрокаПлана.Результат = "Пропущено (лимит итераций)";
		КонецЕсли;
	КонецЦикла;
	
	Диалог.Записать();
	
КонецПроцедуры

// Пропускает шаги плана (SelectObject, ShowInfo об открытии формы), которые повторно падают с ошибкой.
// SelectObject требует reference/object и не работает в режиме без GUI (COM).
Функция ПропуститьПроблемныеШагиПлана(СсылкаДиалога) Экспорт
	
	Диалог = СсылкаДиалога.ПолучитьОбъект();
	
	// Находим первый невыполненный шаг
	Для Каждого СтрокаПлана Из Диалог.План Цикл
		Если СтрокаПлана.Выполнена Тогда
			Продолжить;
		КонецЕсли;
		
		ЗадачаВРег = ВРег(СтрокаПлана.Задача);
		
		// SelectObject и "открыт для просмотра" — бессмысленны без GUI
		Если СтрНайти(ЗадачаВРег, "SELECTOBJECT") > 0 
			ИЛИ (СтрНайти(ЗадачаВРег, "SHOWINFO") > 0 И СтрНайти(ЗадачаВРег, "ОТКРЫТ") > 0) Тогда
			
			// Проверяем, были ли повторные ошибки по этому шагу (SelectObject требует...)
			ТекстОшибок = СобратьФактыПоследнихДействий(СсылкаДиалога);
			ТекстОшибокВРег = ВРег(ТекстОшибок);
			
			КоличествоОшибокSelectObject = 0;
			Если СтрНайти(ЗадачаВРег, "SELECTOBJECT") > 0 Тогда
				Поз = 1;
				Пока Истина Цикл
					Поз = СтрНайти(ТекстОшибокВРег, "SELECTOBJECT ТРЕБУЕТ", НаправлениеПоиска.СНачала, Поз);
					Если Поз = 0 Тогда
						Прервать;
					КонецЕсли;
					КоличествоОшибокSelectObject = КоличествоОшибокSelectObject + 1;
					Поз = Поз + 1;
				КонецЦикла;
			КонецЕсли;
			
			// Если 1+ ошибок SelectObject — пропускаем (в COM без GUI SelectObject не работает)
			Если КоличествоОшибокSelectObject >= 1 Тогда
				СтрокаПлана.Выполнена = Истина;
				СтрокаПлана.Результат = "Пропущено (не поддерживается в режиме без GUI)";
				Диалог.Записать();
				ИИА_Сервер.ДобавитьЗаписьВЛогДиалога(СсылкаДиалога, "[Система] Шаг """ + СтрокаПлана.Задача + """ пропущен (SelectObject не поддерживается без GUI).");
				Возврат Истина;
			КонецЕсли;
			
			// Для ShowInfo "открыт для просмотра" — пропускаем сразу (нет GUI)
			Если СтрНайти(ЗадачаВРег, "SHOWINFO") > 0 И СтрНайти(ЗадачаВРег, "ОТКРЫТ") > 0 Тогда
				СтрокаПлана.Выполнена = Истина;
				СтрокаПлана.Результат = "Пропущено (режим без GUI)";
				Диалог.Записать();
				ИИА_Сервер.ДобавитьЗаписьВЛогДиалога(СсылкаДиалога, "[Система] Шаг """ + СтрокаПлана.Задача + """ пропущен (нет интерфейса).");
				Возврат Истина;
			КонецЕсли;
		КонецЕсли;
		
		// Проверяем только первый невыполненный шаг
		Прервать;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

Функция ПолучитьНевыполненныеЗадачиПользователя(СсылкаДиалога) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Найдено", Ложь);
	Результат.Вставить("ТекстЗадач", "");
	Результат.Вставить("КоличествоЗадач", 0);
	
	Диалог = СсылкаДиалога.ПолучитьОбъект();
	
	Если Диалог.Сообщения.Количество() = 0 Тогда
		Возврат Результат;
	КонецЕсли;
	
	МассивЗадач = Новый Массив;
	
	Для Каждого СтрокаСообщения Из Диалог.Сообщения Цикл
		Если СтрокаСообщения.Автор = Перечисления.ИИА_АвторСообщения.Пользователь Тогда
			ТекстЗадачи = СокрЛП(СтрокаСообщения.Текст);
			Если НЕ ПустаяСтрока(ТекстЗадачи) Тогда
				МассивЗадач.Добавить(ТекстЗадачи);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Если МассивЗадач.Количество() > 0 Тогда
		Результат.Найдено = Истина;
		Результат.КоличествоЗадач = МассивЗадач.Количество();
		
		ТекстЗадач = "";
		Для Индекс = 0 По МассивЗадач.Количество() - 1 Цикл
			Если Индекс > 0 Тогда
				ТекстЗадач = ТекстЗадач + Символы.ПС;
			КонецЕсли;
			ТекстЗадач = ТекстЗадач + МассивЗадач[Индекс];
		КонецЦикла;
		
		Результат.ТекстЗадач = ТекстЗадач;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция СгенерироватьПродолжениеВыполнения(СсылкаДиалога) Экспорт
	
	ИИА_Сервер.ДобавитьЗаписьВЛогДиалога(СсылкаДиалога, "[Система] Фаза 1: Обновление статусов плана...");
	
	// Фаза 1: Обновление плана
	Если НЕ ОбновитьПланПоРезультатам(СсылкаДиалога) Тогда
		ИИА_Сервер.ДобавитьЗаписьВЛогДиалога(СсылкаДиалога, "[Система] Ошибка при обновлении плана. Продолжаем с текущим.");
	Иначе
		ИИА_Сервер.ДобавитьЗаписьВЛогДиалога(СсылкаДиалога, "[Система] План успешно обновлен.");
	КонецЕсли;
	
	// Проверяем, остались ли задачи
	ЕстьНевыполненные = Ложь;
	ПланДанные = ПолучитьПланДиалога(СсылкаДиалога);
	Для Каждого Пункт Из ПланДанные Цикл
		Если НЕ Пункт.Выполнена Тогда
			ЕстьНевыполненные = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если НЕ ЕстьНевыполненные Тогда
		ИИА_Сервер.ДобавитьЗаписьВЛогДиалога(СсылкаДиалога, "[Система] Все задачи выполнены. Переход к резюме.");
		Возврат Ложь;
	КонецЕсли;
	
	// Фаза 2: Генерация следующего шага
	ИИА_Сервер.ДобавитьЗаписьВЛогДиалога(СсылкаДиалога, "[Система] Фаза 2: Генерация следующего шага DSL...");
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, ПланДанные);
	ПланJSON = ЗаписьJSON.Закрыть();
	
	ТекстРезультатов = СобратьФактыПоследнихДействий(СсылкаДиалога);
	ДоступныеПоля = ИзвлечьРеквизитыИзФактов(ТекстРезультатов);
	ПромптСледующегоШага = ИИА_Промты.ПолучитьПромптГенерацииСледующегоШага(ПланJSON, ТекстРезультатов, ДоступныеПоля);
	
	// Вызываем ИИ для генерации DSL
	ОтветИИ = ИИА_Сервер.ВызватьИИССистемнымСообщением(СсылкаДиалога, "Чат", ПромптСледующегоШага, "", "dsl", , Истина);
	
	Если НЕ ПустаяСтрока(ОтветИИ.DSL) Тогда
		Если ЭтоПовторДействия(СсылкаДиалога, ОтветИИ.DSL, 2) Тогда
			ИИА_Сервер.ДобавитьЗаписьВЛогДиалога(СсылкаДиалога, "[LOOP_GUARD] Повтор шага DSL обнаружен, выполнение пропущено.");
			ИИА_Сервер.ДобавитьСообщениеВДиалог(
				СсылкаДиалога,
				Перечисления.ИИА_АвторСообщения.Система,
				Перечисления.ИИА_ТипСообщения.Текст,
				"[LOOP_GUARD] Обнаружен повтор действия. Выбери следующий шаг плана."
			);
			Возврат Истина;
		КонецЕсли;
		
		ИИА_Сервер.ДобавитьЗаписьВЛогДиалога(СсылкаДиалога, "[RAG_DECISION] Следующий шаг: RAG включен (по умолчанию).");
		ИИА_Сервер.ДобавитьЗаписьВЛогДиалога(СсылкаДиалога, "[Система] Автовыполнение следующего шага...");
		// Сразу выполняем сгенерированный DSL на сервере
		РезультатАвтоDSL = ИИА_Сервер.ВыполнитьDSLСценарийССообщениями(СсылкаДиалога, ОтветИИ.DSL);
		
		// Retry при ошибке "Поле не найдено" — исправляем запрос с учётом полей из GetObjectFields
		Если РезультатАвтоDSL <> Неопределено И НЕ РезультатАвтоDSL.Успех Тогда
			ТекстОшибки = ?(РезультатАвтоDSL.Свойство("Сообщение"), РезультатАвтоDSL.Сообщение, "");
			ТекстОшибкиВРег = ВРег(ТекстОшибки);
			Если СтрНайти(ТекстОшибкиВРег, "ПОЛЕ НЕ НАЙДЕНО") > 0 ИЛИ СтрНайти(ТекстОшибкиВРег, "RUNQUERY") > 0 Тогда
				ТекстФактовПоОшибке = СобратьФактыПоследнихДействий(СсылкаДиалога);
				ПоляДляRetry = ИзвлечьРеквизитыИзФактов(ТекстФактовПоОшибке);
				Если НЕ ПустаяСтрока(ПоляДляRetry) Тогда
					ИИА_Сервер.ДобавитьЗаписьВЛогДиалога(СсылкаДиалога, "[Retry] Ошибка RunQuery (поле не найдено). Попытка исправления с полями из GetObjectFields...");
					ПромптИсправления = ИИА_Промты.ПолучитьПромптИсправленияDSL(ТекстОшибки, ОтветИИ.DSL, ПоляДляRetry);
					ОтветИсправления = ИИА_Сервер.ВызватьИИССистемнымСообщением(СсылкаДиалога, "Чат", ПромптИсправления, "", "dsl", , Ложь);
					Если НЕ ПустаяСтрока(ОтветИсправления.DSL) Тогда
						РезультатАвтоDSL = ИИА_Сервер.ВыполнитьDSLСценарийССообщениями(СсылкаДиалога, ОтветИсправления.DSL);
						Если РезультатАвтоDSL <> Неопределено И РезультатАвтоDSL.Успех Тогда
							ИИА_Сервер.ДобавитьЗаписьВЛогДиалога(СсылкаДиалога, "[Retry] Запрос исправлен и выполнен успешно.");
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

#КонецОбласти

#Область ПроверкаИРезюме

Функция СгенерироватьSummary(СсылкаДиалога) Экспорт
	
	Попытка
		
		Диалог = СсылкаДиалога.ПолучитьОбъект();
		
		// Получаем все сообщения диалога для контекста
		МассивИстории = ИИА_Сервер.ПолучитьСообщенияДиалога(СсылкаДиалога, 100);
		История = ИИА_Сервер.ПреобразоватьМассивСообщенийВТаблицу(МассивИстории);
		
		// Получаем информацию о созданных/измененных объектах
		ТекстИзмененныхОбъектов = "";
		Если Диалог.ИзмененныеОбъекты.Количество() > 0 Тогда
			ТекстИзмененныхОбъектов = "Созданные/измененные объекты:" + Символы.ПС;
			Для Каждого СтрокаИзмененныхОбъектов Из Диалог.ИзмененныеОбъекты Цикл
				Если ЗначениеЗаполнено(СтрокаИзмененныхОбъектов.СсылкаНаОбъект) Тогда
					ТекстИзмененныхОбъектов = ТекстИзмененныхОбъектов + "- " + СтрокаИзмененныхОбъектов.СсылкаНаОбъект + Символы.ПС;
				КонецЕсли;
			КонецЦикла;
		Иначе
			ТекстИзмененныхОбъектов = "Объекты не создавались и не изменялись.";
		КонецЕсли;
		
		// Получаем все задачи пользователя из истории диалога
		ТекстЗадач = "";
		Для Каждого СтруктураСообщения Из МассивИстории Цикл
			Если СтруктураСообщения.Автор = Перечисления.ИИА_АвторСообщения.Пользователь Тогда
				ТекстЗадачи = СокрЛП(СтруктураСообщения.Текст);
				Если НЕ ПустаяСтрока(ТекстЗадачи) Тогда
					Если НЕ ПустаяСтрока(ТекстЗадач) Тогда
						ТекстЗадач = ТекстЗадач + Символы.ПС;
					КонецЕсли;
					ТекстЗадач = ТекстЗадач + ТекстЗадачи;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		// Извлекаем результаты выполнения DSL из системных сообщений
		ТекстРезультатовDSL = "";
		Для Индекс = 0 По МассивИстории.Количество() - 1 Цикл
			СтруктураСообщения = МассивИстории[Индекс];
			
			Если СтруктураСообщения.Автор = Перечисления.ИИА_АвторСообщения.ИИ 
				И НЕ ПустаяСтрока(СтруктураСообщения.ТекстКода) Тогда
				
				Если Индекс + 1 < МассивИстории.Количество() Тогда
					СледующееСообщение = МассивИстории[Индекс + 1];
					Если СледующееСообщение.Автор = Перечисления.ИИА_АвторСообщения.Система 
						И НЕ ПустаяСтрока(СледующееСообщение.Текст) Тогда
						
						ТекстРезультата = СокрЛП(СледующееСообщение.Текст);
						Если НЕ ПустаяСтрока(ТекстРезультата) Тогда
							Если НЕ ПустаяСтрока(ТекстРезультатовDSL) Тогда
								ТекстРезультатовDSL = ТекстРезультатовDSL + Символы.ПС;
							КонецЕсли;
							ТекстРезультатовDSL = ТекстРезультатовDSL + "DSL-сценарий: " + СокрЛП(СтруктураСообщения.ТекстКода) + Символы.ПС;
							ТекстРезультатовDSL = ТекстРезультатовDSL + "Результат: " + ТекстРезультата;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		// Получаем настройки ИИ для пользователя диалога
		Пользователь = Диалог.Пользователь;
		ПараметрыИИ = ИИА_Сервер.ПолучитьНастройкиПользователя(Пользователь);
		ПараметрыИИ.Вставить("Пользователь", Пользователь);
		
		// Формируем промпт для генерации summary
		ПромптSummary = ИИА_Промты.СформироватьПромптРезюме(ТекстЗадач, ТекстИзмененныхОбъектов, ТекстРезультатовDSL);
		
		// Вызываем ИИ для генерации summary
		ОтветИИ = ИИА_Сервер.ВызватьИИССистемнымСообщением(СсылкаДиалога, "Чат", ПромптSummary, "", "text");
		
		ТекстSummary = "";
		Если ОтветИИ.Свойство("Текст") И НЕ ПустаяСтрока(ОтветИИ.Текст) Тогда
			ТекстSummary = ОтветИИ.Текст;
		ИначеЕсли ОтветИИ.Свойство("DSL") И НЕ ПустаяСтрока(ОтветИИ.DSL) Тогда
			ТекстSummary = ОтветИИ.DSL;
		КонецЕсли;
		
		Если СтрНачинаетсяС(СокрЛП(ТекстSummary), "{") Тогда
			Попытка
				Чтение = Новый ЧтениеJSON;
				Чтение.УстановитьСтроку(ТекстSummary);
				ДанныеJSON = ПрочитатьJSON(Чтение);
				Чтение.Закрыть();
				
				Если ТипЗнч(ДанныеJSON) = Тип("Структура") Тогда
					Если ДанныеJSON.Свойство("summary") Тогда
						ТекстSummary = ДанныеJSON.summary;
					ИначеЕсли ДанныеJSON.Свойство("text") Тогда
						ТекстSummary = ДанныеJSON.text;
					ИначеЕсли ДанныеJSON.Свойство("резюме") Тогда
						ТекстSummary = ДанныеJSON.резюме;
					КонецЕсли;
				КонецЕсли;
			Исключение
			КонецПопытки;
		КонецЕсли;
		
		Возврат ТекстSummary;
		
	Исключение
		Возврат "Ошибка при генерации summary: " + ОписаниеОшибки();
	КонецПопытки;
	
КонецФункции

Функция ИзвлечьSummaryИзТекста(Знач ИсходныйТекст) Экспорт
	
	ЧистыйТекст = "";
	
	ТекстБезЗаголовка = СтрЗаменить(ИсходныйТекст, "=== РЕЗЮМЕ ВЫПОЛНЕННОЙ РАБОТЫ ===", "");
	
	ПозНачалаJSON = СтрНайти(ТекстБезЗаголовка, "```json");
	ПозКонцаJSON = СтрНайти(ТекстБезЗаголовка, "```", НаправлениеПоиска.СКонца);
	
	Если ПозНачалаJSON > 0 И ПозКонцаJSON > ПозНачалаJSON Тогда
		Префикс = Лев(ТекстБезЗаголовка, ПозНачалаJSON - 1);
		СтрокаJSON = Сред(ТекстБезЗаголовка, ПозНачалаJSON + 7, ПозКонцаJSON - (ПозНачалаJSON + 7));
		
		Попытка
			Чтение = Новый ЧтениеJSON;
			Чтение.УстановитьСтроку(СтрокаJSON);
			ДанныеJSON = ПрочитатьJSON(Чтение);
			Чтение.Закрыть();
			
			Если ТипЗнч(ДанныеJSON) = Тип("Структура") И ДанныеJSON.Свойство("summary") Тогда
				ЧистыйТекст = СокрЛП(Префикс) + Символы.ПС + Символы.ПС + ДанныеJSON.summary;
			ИначеЕсли ТипЗнч(ДанныеJSON) = Тип("Соответствие") И ДанныеJSON.Получить("summary") <> Неопределено Тогда
				ЧистыйТекст = СокрЛП(Префикс) + Символы.ПС + Символы.ПС + ДанныеJSON.Получить("summary");
			Иначе
				ЧистыйТекст = ТекстБезЗаголовка;
			КонецЕсли;
		Исключение
			ЧистыйТекст = ТекстБезЗаголовка;
		КонецПопытки;
	Иначе
		ЧистыйТекст = ТекстБезЗаголовка;
	КонецЕсли;
	
	Возврат СокрЛП(ЧистыйТекст);
	
КонецФункции

Процедура ВыполнитьФинальнуюПроверкуИSummary(СсылкаДиалога) Экспорт
	
	РезультатПроверки = ПроверитьРезультатВыполненияЗадачи(СсылкаДиалога);
	ИИА_Сервер.УстановитьРезультатПроверкиВХранилище(СсылкаДиалога, РезультатПроверки.ПроверкаВыполнена, РезультатПроверки.Причина);
	
	ТекстSummary = СгенерироватьSummary(СсылкаДиалога);
	Если НЕ ПустаяСтрока(ТекстSummary) Тогда
		Дополнение = "";
		Если НЕ ПустаяСтрока(РезультатПроверки.Причина) Тогда
			Дополнение = Символы.ПС + Символы.ПС + "Проверка: " + РезультатПроверки.Причина;
		КонецЕсли;
		
		ТекстSummary = ТекстSummary + Дополнение;
		
		ИИА_Сервер.ДобавитьСообщениеВДиалог(
			СсылкаДиалога,
			Перечисления.ИИА_АвторСообщения.Система,
			Перечисления.ИИА_ТипСообщения.Текст,
			"=== РЕЗЮМЕ ВЫПОЛНЕННОЙ РАБОТЫ ===" + Символы.ПС + Символы.ПС + ТекстSummary,
			"",
			"",
			0
		);
	КонецЕсли;
	
	// Отправляем финальное уведомление
	ДанныеУведомления = Новый Структура;
	ДанныеУведомления.Вставить("Диалог", СсылкаДиалога);
	ДанныеУведомления.Вставить("ТипСобытия", "ЗадачаЗавершена");
	ДанныеУведомления.Вставить("Успех", РезультатПроверки.ПроверкаВыполнена);
	УведомленияКлиента.ОтправитьУведомление("СообщениеПереписки", ДанныеУведомления);
	
КонецПроцедуры

Функция ПроверитьРезультатВыполненияЗадачи(СсылкаДиалога) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("ПроверкаВыполнена", Ложь);
	Результат.Вставить("Причина", "");
	
	ПервоеСообщение = ИИА_Сервер.ПолучитьПервоеСообщениеПользователя(СсылкаДиалога);
	Если НЕ ПервоеСообщение.Найдено Тогда
		Результат.Причина = "Не найдена исходная задача";
		Возврат Результат;
	КонецЕсли;
	
	ТекстЗадачи = ПервоеСообщение.Текст;
	Диалог = СсылкаДиалога.ПолучитьОбъект();

	// ДЕТЕРМИНИРОВАННАЯ ПРОВЕРКА
	ПоследнийСистРез = ПолучитьПоследнийDslSystemResult(СсылкаДиалога);
	Если ПоследнийСистРез.Найдено Тогда
		
		Если НЕ ПоследнийСистРез.Успех Тогда
			Результат.ПроверкаВыполнена = Ложь;
			Результат.Причина = "Последнее выполнение DSL завершилось ошибкой.";
			ИИА_Сервер.УстановитьРезультатПроверкиВХранилище(СсылкаДиалога, Результат.ПроверкаВыполнена, Результат.Причина);
			Возврат Результат;
		КонецЕсли;
		
		Если Диалог.ТипДиалога = Перечисления.ИИА_ТипДиалога.Запрос1С Тогда
			ПроверкаВывода = ПроверитьВыводДанныхЗапроса(СсылкаДиалога);
			Если ПроверкаВывода.ЕстьТабличныйДокумент Тогда
				Результат.ПроверкаВыполнена = Истина;
				Результат.Причина = "Данные выведены: " + ПроверкаВывода.Причина;
			Иначе
				Результат.ПроверкаВыполнена = Ложь;
				Результат.Причина = "Нет подтверждения вывода данных (RunQuery или таблица).";
			КонецЕсли;
			ИИА_Сервер.УстановитьРезультатПроверкиВХранилище(СсылкаДиалога, Результат.ПроверкаВыполнена, Результат.Причина);
			Возврат Результат;
		Иначе
			Результат.ПроверкаВыполнена = Истина;
			Результат.Причина = "Последнее выполнение DSL успешно.";
			ИИА_Сервер.УстановитьРезультатПроверкиВХранилище(СсылкаДиалога, Результат.ПроверкаВыполнена, Результат.Причина);
			Возврат Результат;
		КонецЕсли;
		
	КонецЕсли;

	ТекстРезультатов = "";
	Для Индекс = Макс(0, Диалог.Сообщения.Количество() - 20) По Диалог.Сообщения.Количество() - 1 Цикл
		СтрокаСообщения = Диалог.Сообщения[Индекс];
		Если СтрокаСообщения.Автор = Перечисления.ИИА_АвторСообщения.Система Тогда
			ТекстРезультатов = ТекстРезультатов + Символы.ПС + СтрокаСообщения.Текст;
		КонецЕсли;
	КонецЦикла;
	
	Если НЕ ПустаяСтрока(ТекстРезультатов) Тогда
		ТекстВРег = ВРег(ТекстРезультатов);
		ЕстьУспех = (СтрНайти(ТекстВРег, "DSL_SYSTEM_RESULT") > 0 
			И СтрНайти(ТекстВРег, "SUCCESS") > 0 
			И СтрНайти(ТекстВРег, "TRUE") > 0);
		ЕстьДанные = (СтрНайти(ТекстВРег, "RUNQUERY") > 0 ИЛИ СтрНайти(ТекстВРег, "SHOWINFO") > 0);
		
		Если ЕстьУспех И ЕстьДанные Тогда
			Результат.ПроверкаВыполнена = Истина;
			Результат.Причина = "Подтверждено по системным результатам (RunQuery/ShowInfo).";
			ИИА_Сервер.УстановитьРезультатПроверкиВХранилище(СсылкаДиалога, Результат.ПроверкаВыполнена, Результат.Причина);
			Возврат Результат;
		КонецЕсли;
	КонецЕсли;
	
	ПромптПроверки = ИИА_Промты.СформироватьПромптПроверкиЗадачи(ТекстЗадачи, ТекстРезультатов);
	РезультатВызова = ИИА_Сервер.ВызватьИИССистемнымСообщением(СсылкаДиалога, "Чат", ПромптПроверки, "", "dsl");
	
	ТекстОтвета = "";
	DSLДляРазбора = "";
	
	Если РезультатВызова.ТипОтвета = "DSL" И НЕ ПустаяСтрока(РезультатВызова.DSL) Тогда
		DSLДляРазбора = РезультатВызова.DSL;
	ИначеЕсли РезультатВызова.ТипОтвета = "ОшибкаКонтракта" 
		И РезультатВызова.Свойство("DSL") 
		И НЕ ПустаяСтрока(РезультатВызова.DSL) Тогда
		DSLДляРазбора = РезультатВызова.DSL;
	КонецЕсли;
	
	Если НЕ ПустаяСтрока(DSLДляРазбора) Тогда
		Попытка
			ЧтениеJSON = Новый ЧтениеJSON;
			ЧтениеJSON.УстановитьСтроку(DSLДляРазбора);
			Сценарий = ПрочитатьJSON(ЧтениеJSON);
			ЧтениеJSON.Закрыть();
			
			Если ТипЗнч(Сценарий) = Тип("Структура") Тогда
				Если Сценарий.Свойство("steps") И ТипЗнч(Сценарий.steps) = Тип("Массив") Тогда
					Для Каждого Шаг Из Сценарий.steps Цикл
						Если Шаг.action = "ShowInfo" И Шаг.Свойство("message") Тогда
							ТекстОтвета = Шаг.message;
							Прервать;
						КонецЕсли;
					КонецЦикла;
				ИначеЕсли Сценарий.Свойство("action") Тогда
					Если ВРег(Сценарий.action) = "SHOWINFO" И Сценарий.Свойство("message") Тогда
						ТекстОтвета = Сценарий.message;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		Исключение
			// ignored
		КонецПопытки;
	КонецЕсли;
	
	Если ПустаяСтрока(ТекстОтвета) Тогда
		ТекстОтвета = РезультатВызова.Текст;
	КонецЕсли;
	
	ТекстОтветаВРег = ВРег(ТекстОтвета);
	
	Если СтрНачинаетсяС(ТекстОтветаВРег, "ДА") 
		ИЛИ СтрНачинаетсяС(ТекстОтветаВРег, "'ДА") 
		ИЛИ СтрНачинаетсяС(ТекстОтветаВРег, """ДА") Тогда
		
		Диалог = СсылкаДиалога.ПолучитьОбъект();
		Если Диалог.ТипДиалога = Перечисления.ИИА_ТипДиалога.Запрос1С Тогда
			
			ТаблицаПоказана = Ложь;
			РезультатИзХранилища = ИИА_Сервер.ПолучитьРезультатПроверкиИзХранилища(СсылкаДиалога);
			Если РезультатИзХранилища <> Неопределено И РезультатИзХранилища.Свойство("ТаблицаПоказана") Тогда
				ТаблицаПоказана = РезультатИзХранилища.ТаблицаПоказана;
			КонецЕсли;
			
			Если ТаблицаПоказана Тогда
				ЕстьТабличныйДокумент = Истина;
				ПричинаЛога = "Явный флаг ТаблицаПоказана из хранилища";
			Иначе
				ЕстьТабличныйДокумент = Ложь;
				ПричинаЛога = "";
				КоличествоСообщений = Диалог.Сообщения.Количество();
				Для Индекс = Макс(0, КоличествоСообщений - 6) По КоличествоСообщений - 2 Цикл
					СтрокаСообщения = Диалог.Сообщения[Индекс];
					Если СтрокаСообщения.Автор = Перечисления.ИИА_АвторСообщения.ИИ И СтрокаСообщения.ТипСообщения = Перечисления.ИИА_ТипСообщения.Код Тогда
						Попытка
							ЧтениеJSON = Новый ЧтениеJSON;
							ЧтениеJSON.УстановитьСтроку(СтрокаСообщения.ТекстКода);
							Сценарий = ПрочитатьJSON(ЧтениеJSON);
							ЧтениеJSON.Закрыть();
							
							Если Сценарий.Свойство("steps") И ТипЗнч(Сценарий.steps) = Тип("Массив") Тогда
								Для Каждого Шаг Из Сценарий.steps Цикл
									Если Шаг.Свойство("action") И (ВРег(Шаг.action) = "RUNQUERY" ИЛИ ВРег(Шаг.action) = "SHOWINFO") Тогда
										ЕстьТабличныйДокумент = Истина;
										ПричинаЛога = "Найден шаг " + Шаг.action + " в сообщении ИИ #" + Индекс;
										Прервать;
									КонецЕсли;
								КонецЦикла;
							КонецЕсли;
						Исключение
							ТекстКодаВРег = ВРег(СтрокаСообщения.ТекстКода);
							Если СтрНайти(ТекстКодаВРег, "RUNQUERY") > 0 Тогда
								ЕстьТабличныйДокумент = Истина;
								ПричинаЛога = "Найдена подстрока RUNQUERY в сообщении ИИ #" + Индекс;
							ИначеЕсли СтрНайти(ТекстКодаВРег, "SHOWINFO") > 0 Тогда
								ЕстьТабличныйДокумент = Истина;
								ПричинаЛога = "Найдена подстрока SHOWINFO в сообщении ИИ #" + Индекс;
							КонецЕсли;
						КонецПопытки;
						
						Если ЕстьТабличныйДокумент Тогда
							Прервать;
						КонецЕсли;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			
			ЗаписьЛога = "Проверка наличия вывода данных: " + ?(ЕстьТабличныйДокумент, "ДА (" + ПричинаЛога + ")", "НЕТ");
			ИИА_Сервер.ДобавитьЗаписьВЛогДиалога(СсылкаДиалога, ЗаписьЛога);
			
			Если НЕ ЕстьТабличныйДокумент Тогда
				Результат.ПроверкаВыполнена = Ложь;
				Результат.Причина = "ИИ считает задачу выполненной, но не был выполнен шаг RunQuery для отображения данных (ТабличныйДокумент). Обязательно выполни запрос к базе данных.";
			Иначе
				Результат.ПроверкаВыполнена = Истина;
				Результат.Причина = ТекстОтвета;
			КонецЕсли;
			
		Иначе
			Результат.ПроверкаВыполнена = Истина;
			Результат.Причина = ТекстОтвета;
		КонецЕсли;
		
	Иначе
		Результат.ПроверкаВыполнена = Ложь;
		Результат.Причина = ТекстОтвета;
	КонецЕсли;
	
	ИИА_Сервер.УстановитьРезультатПроверкиВХранилище(СсылкаДиалога, Результат.ПроверкаВыполнена, Результат.Причина);
	Возврат Результат;
	
КонецФункции

#КонецОбласти

Процедура ОтправитьУведомление(СсылкаДиалога, ТипСобытия)
	
	ДанныеУведомления = Новый Структура;
	ДанныеУведомления.Вставить("Диалог", СсылкаДиалога);
	ДанныеУведомления.Вставить("ТипСобытия", ТипСобытия);
	УведомленияКлиента.ОтправитьУведомление("СообщениеПереписки", ДанныеУведомления);
	
КонецПроцедуры

Процедура ОбновитьСтатусПоследнегоСообщения(СсылкаДиалога, НовыйСтатус)
	
	Если НЕ ЗначениеЗаполнено(СсылкаДиалога) Тогда
		Возврат;
	КонецЕсли;
	
	Диалог = СсылкаДиалога.ПолучитьОбъект();
	Если Диалог.Сообщения.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаСообщения = Диалог.Сообщения[Диалог.Сообщения.Количество() - 1];
	СтрокаСообщения.Статус = НовыйСтатус;
	Диалог.Записать();
	
	ИИА_Сервер.ДобавитьЗаписьВЛогДиалога(СсылкаДиалога, "[Система] Обновлен статус сообщения: " + НовыйСтатус);
	
КонецПроцедуры

Функция ПолучитьПоследнийDslSystemResult(СсылкаДиалога)
	
	Результат = Новый Структура;
	Результат.Вставить("Найдено", Ложь);
	Результат.Вставить("Успех", Ложь);
	Результат.Вставить("Текст", "");
	
	Если НЕ ЗначениеЗаполнено(СсылкаДиалога) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Диалог = СсылкаДиалога.ПолучитьОбъект();
	Если Диалог.Сообщения.Количество() = 0 Тогда
		Возврат Результат;
	КонецЕсли;
	
	Для Индекс = Диалог.Сообщения.Количество() - 1 По 0 Цикл
		СтрокаСообщения = Диалог.Сообщения[Индекс];
		Если СтрокаСообщения.Автор = Перечисления.ИИА_АвторСообщения.Система
			И НЕ ПустаяСтрока(СтрокаСообщения.Текст)
			И СтрНайти(СтрокаСообщения.Текст, "dsl_system_result") > 0 Тогда
			
			ТекстJSON = ИИА_DSL.НормализоватьJSONТекст(СтрокаСообщения.Текст);
			
			Результат.Найдено = Истина;
			Результат.Текст = ?(ПустаяСтрока(ТекстJSON), СтрокаСообщения.Текст, ТекстJSON);
			
			Если НЕ ПустаяСтрока(ТекстJSON) Тогда
				Попытка
					ЧтениеJSON = Новый ЧтениеJSON;
					ЧтениеJSON.УстановитьСтроку(ТекстJSON);
					Данные = ПрочитатьJSON(ЧтениеJSON);
					ЧтениеJSON.Закрыть();
					
					Если ТипЗнч(Данные) = Тип("Структура") И Данные.Свойство("success") Тогда
						Результат.Успех = Данные.success;
					КонецЕсли;
				Исключение
				КонецПопытки;
			КонецЕсли;
			
			Возврат Результат;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ПроверитьВыводДанныхЗапроса(СсылкаДиалога)
	
	Результат = Новый Структура("ЕстьТабличныйДокумент, Причина", Ложь, "");
	Если НЕ ЗначениеЗаполнено(СсылкаДиалога) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Диалог = СсылкаДиалога.ПолучитьОбъект();
	
	ТаблицаПоказана = Ложь;
	РезультатИзХранилища = ИИА_Сервер.ПолучитьРезультатПроверкиИзХранилища(СсылкаДиалога);
	Если РезультатИзХранилища <> Неопределено
		И ТипЗнч(РезультатИзХранилища) = Тип("Структура")
		И РезультатИзХранилища.Свойство("ТаблицаПоказана") Тогда
		ТаблицаПоказана = РезультатИзХранилища.ТаблицаПоказана;
	КонецЕсли;
	
	Если ТаблицаПоказана Тогда
		Результат.ЕстьТабличныйДокумент = Истина;
		Результат.Причина = "Явный флаг ТаблицаПоказана из хранилища";
		Возврат Результат;
	КонецЕсли;
	
	КоличествоСообщений = Диалог.Сообщения.Количество();
	Для Индекс = Макс(0, КоличествоСообщений - 6) По КоличествоСообщений - 1 Цикл
		СтрокаСообщения = Диалог.Сообщения[Индекс];
		Если СтрокаСообщения.Автор = Перечисления.ИИА_АвторСообщения.ИИ
			И СтрокаСообщения.ТипСообщения = Перечисления.ИИА_ТипСообщения.Код
			И НЕ ПустаяСтрока(СтрокаСообщения.ТекстКода) Тогда
			
			Попытка
				ЧтениеJSON = Новый ЧтениеJSON;
				ЧтениеJSON.УстановитьСтроку(ИИА_DSL.НормализоватьJSONТекст(СтрокаСообщения.ТекстКода));
				Сценарий = ПрочитатьJSON(ЧтениеJSON);
				ЧтениеJSON.Закрыть();
				
				Если ТипЗнч(Сценарий) = Тип("Структура") И Сценарий.Свойство("steps") И ТипЗнч(Сценарий.steps) = Тип("Массив") Тогда
					Для Каждого Шаг Из Сценарий.steps Цикл
						Если Шаг.Свойство("action") Тогда
							Действие = ВРег(Шаг.action);
							Если Действие = "RUNQUERY" ИЛИ Действие = "SHOWINFO" Тогда
								Результат.ЕстьТабличныйДокумент = Истина;
								Результат.Причина = "Найден шаг " + Шаг.action;
								Возврат Результат;
							КонецЕсли;
						КонецЕсли;
					КонецЦикла;
				КонецЕсли;
			Исключение
			КонецПопытки;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#Область СлужебныеПроцедурыИФункции

// Извлекает блок "Реквизиты:" из текста фактов (результатов GetObjectFields) для передачи в промпт RunQuery
//
// Параметры:
//  ТекстФактов - Строка - текст из СобратьФактыПоследнихДействий
//
// Возвращаемое значение:
//  Строка - извлечённый список реквизитов или пустая строка
//
Функция ИзвлечьРеквизитыИзФактов(ТекстФактов) Экспорт
	
	Если ПустаяСтрока(ТекстФактов) Тогда
		Возврат "";
	КонецЕсли;
	
	ПозРеквизиты = СтрНайти(ТекстФактов, "Реквизиты:");
	Если ПозРеквизиты <= 0 Тогда
		Возврат "";
	КонецЕсли;
	
	// Берём текст после "Реквизиты:" до следующего структурного блока или конца
	Начало = ПозРеквизиты + СтрДлина("Реквизиты:");
	Остаток = Сред(ТекстФактов, Начало);
	
	// Обрезаем по "steps" или "dsl_system_result" или другому ключевому маркеру
	Маркеры = Новый Массив;
	Маркеры.Добавить("""steps""");
	Маркеры.Добавить("dsl_system_result");
	Маркеры.Добавить("Выполнен DSL");
	Маркеры.Добавить("Ошибка выполнения");
	
	КонецБлока = СтрДлина(Остаток) + 1;
	Для Каждого Маркер Из Маркеры Цикл
		Поз = СтрНайти(Остаток, Маркер);
		Если Поз > 0 И Поз < КонецБлока Тогда
			КонецБлока = Поз;
		КонецЕсли;
	КонецЦикла;
	
	БлокРеквизитов = Лев(Остаток, КонецБлока - 1);
	БлокРеквизитов = СокрЛП(БлокРеквизитов);
	
	// Ограничиваем длину (чтобы не раздувать промпт)
	Если СтрДлина(БлокРеквизитов) > 1500 Тогда
		БлокРеквизитов = Лев(БлокРеквизитов, 1500) + "...";
	КонецЕсли;
	
	Возврат БлокРеквизитов;
	
КонецФункции

Функция СобратьФактыПоследнихДействий(СсылкаДиалога) Экспорт
	
	Диалог = СсылкаДиалога.ПолучитьОбъект();
	КоличествоСообщений = Диалог.Сообщения.Количество();
	
	МассивФрагментов = Новый Массив;
	СчетчикСистемных = 0;
	СчетчикDSL = 0;
	РеквизитыДобавлены = Ложь;
	
	Индекс = КоличествоСообщений - 1;
	Пока Индекс >= 0 Цикл
		СтрокаСообщения = Диалог.Сообщения[Индекс];
		
		АвторСообщения = СтрокаСообщения.Автор;
		ТипСообщения   = СтрокаСообщения.ТипСообщения;
		
		Если АвторСообщения = Перечисления.ИИА_АвторСообщения.Система 
			ИЛИ АвторСообщения = Перечисления.ИИА_АвторСообщения.ИИ Тогда
			
			Если АвторСообщения = Перечисления.ИИА_АвторСообщения.ИИ И НЕ ПустаяСтрока(СтрокаСообщения.ТекстКода) Тогда
				ТекстСообщения = СтрокаСообщения.ТекстКода;
			Иначе
				ТекстСообщения = СтрокаСообщения.Текст;
			КонецЕсли;
			ТекстСообщения = СокрЛП(ТекстСообщения);
			
			Если ПустаяСтрока(ТекстСообщения) Тогда
				Индекс = Индекс - 1;
				Продолжить;
			КонецЕсли;
			
			// Берем результаты DSL (dsl_system_result), ошибки, сообщения с Реквизитами (GetObjectFields) и DSL-команды ИИ
			ЭтоРезультат = (СтрНайти(ТекстСообщения, "dsl_system_result") > 0);
			ЭтоОшибка    = (ТипСообщения = Перечисления.ИИА_ТипСообщения.Ошибка);
			ЭтоРеквизиты = (АвторСообщения = Перечисления.ИИА_АвторСообщения.Система И СтрНайти(ТекстСообщения, "Реквизиты:") > 0);
			ЭтоDSL       = (АвторСообщения = Перечисления.ИИА_АвторСообщения.ИИ И НЕ ПустаяСтрока(СтрокаСообщения.ТекстКода));
			
			Если ЭтоРезультат ИЛИ ЭтоОшибка Тогда
				
				Если СчетчикСистемных < 5 Тогда
					СчетчикСистемных = СчетчикСистемных + 1;
					
					ТекстДляДобавления = ТекстСообщения;
					Если СтрДлина(ТекстДляДобавления) > 3000 Тогда
						ТекстДляДобавления = Лев(ТекстДляДобавления, 3000) + "...(truncated)";
					КонецЕсли;
					
					МассивФрагментов.Вставить(0, ТекстДляДобавления);
				КонецЕсли;
				
			ИначеЕсли ЭтоРеквизиты И НЕ РеквизитыДобавлены Тогда
				
				// Сообщение "DSL-сценарий выполнен успешно" + блок Реквизиты — нужно для RunQuery
				РеквизитыДобавлены = Истина;
				ТекстДляДобавления = ТекстСообщения;
				Если СтрДлина(ТекстДляДобавления) > 2500 Тогда
					ТекстДляДобавления = Лев(ТекстДляДобавления, 2500) + "...(truncated)";
				КонецЕсли;
				МассивФрагментов.Вставить(0, ТекстДляДобавления);
				
			ИначеЕсли ЭтоDSL Тогда
				
				Если СчетчикDSL < 5 Тогда
					СчетчикDSL = СчетчикDSL + 1;
					
					ТекстDSL = ТекстСообщения;
					Если СтрДлина(ТекстDSL) > 2000 Тогда
						ТекстDSL = Лев(ТекстDSL, 2000) + "...(truncated)";
					КонецЕсли;
					
					МассивФрагментов.Вставить(0, "Выполнен DSL: " + ТекстDSL);
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если СчетчикСистемных >= 5 И СчетчикDSL >= 5 Тогда
			Прервать;
		КонецЕсли;
		
		Индекс = Индекс - 1;
	КонецЦикла;
	
	ТекстРезультатов = "";
	Для Каждого Фрагмент Из МассивФрагментов Цикл
		Если НЕ ПустаяСтрока(ТекстРезультатов) Тогда
			ТекстРезультатов = ТекстРезультатов + Символы.ПС;
		КонецЕсли;
		ТекстРезультатов = ТекстРезультатов + Фрагмент;
	КонецЦикла;
	
	Возврат ТекстРезультатов;
	
КонецФункции

#КонецОбласти
